[
  {
    "dates": "August 2025 – Present",
    "role": "Fulbright Scholar",
    "org": "Fulbright Taiwan",
    "summary": "I’m living in New Taipei, Taiwan as a Fulbright Scholar, working in local elementary schools and engaging cross-culturally with students and staff. I also created and lead a collaboration with ChatGPT for Education/OpenAI and 20 Fulbright Scholars across Taiwan to benchmark education use cases for GPT-5 in K–12 English classrooms. This initiative, called a “Local Lab,” is the first partnership of its kind.",
    "link": "https://fulbright.org/",
    "link_text": "Fulbright is one of the most competitive fellowship programs in the world. Learn more here →"
  },
  {
    "dates": "March 2025 – Present",
    "role": "ChatGPT Lab Member",
    "org": "OpenAI",
    "summary": "I was selected as a member of the first-ever ChatGPT Lab, a small group of students from across the United States and Canada that provides critical insight to OpenAI on education use and product launches. Through this program, I helped publish OpenAI’s first book, worked directly with product and marketing teams across five major launches, and participated in workshops with other Lab members.",
    "link": "https://chatgpt.com/use-cases/students",
    "link_text": "We developed 100 uses for ChatGPT in higher education. Learn more here →"
  },
  {
    "dates": "June 2025 – August 2025",
    "role": "AI and Emerging Tech Research Fellow",
    "org": "Council for State Governments, Center for Innovation",
    "summary": "Over a few short weeks, I designed, built, and presented the first-ever state government AI adoption index, measuring across 900 data inputs how 56 state and territory governments across the United States are embracing generative artificial intelligence."
  },
  {
    "dates": "May 2024 – August 2025",
    "role": "Social Impact Communications and Strategy",
    "org": "Boehringer Ingelheim Pharmaceuticals",
    "summary": "During my tenure at Boehringer, I directed the company’s corporate foundation’s communications strategy. I spearheaded a comprehensive rebranding initiative, conducted in-depth data analyses for narrative development, enhanced employee engagement, and collaborated with UX/UI teams to optimize user experiences for both private and public foundation resources.",
    "link": "https://www.boehringer-ingelheim.com/annualreport/2024/facts-and-figures/",
    "link_text": "Boehringer Ingelheim is one of the largest life sciences companies in the world. Learn more here →"
  },
  {
    "dates": "January 2024 – April 2025",
    "role": "Freelance Communications Strategy Consultant",
    "org": "Isaac Seiler Strategies",
    "summary": "I founded and ran my own consultancy where I took on 7+ clients and delivered full digital products tailored to their needs. I worked on everything from visual assets to crisis communications, supporting organizations in Arizona, California, and Michigan.",
    "link": "https://www.allysonfortustin.com/",
    "link_text": "Check out one of the campaigns I consulted for here, including the website I built →"
  },
  {
    "dates": "November 2022 – June 2023",
    "role": "Communications Director and Transition Aide",
    "org": "United States House of Representatives",
    "summary": "I was the first staff member for a new congressional office, directing hiring, strategy formation, and complex logistics. It was my responsibility to build a political brand and create an entire congressional operation in under two months. I then built and led a competitive communications program for a new frontline member of Congress, becoming the youngest person ever to serve as Director of Communications in congressional history. I placed stories in the New York Times, Washington Post, and others, and secured cable hits on CNN’s State of the Union with Jake Tapper and Dana Bash. I led all earned, owned, and paid media for the office, reaching hundreds of thousands of people every week.",
    "link": "https://www.notion.so/Press-Hit-List-25b96844a3ac4a8abac3d749412938cb?source=copy_link",
    "link_text": "Check out a sample of my press hits and other materials here →"
  },
  {
    "dates": "June 2022 – November 2022",
    "role": "Digital Director and Fellow",
    "org": "Hillary Scholten for U.S. Congress",
    "summary": "I began as a fellow on one of the most high-profile congressional races of 2022 and quickly moved up to oversee the campaign’s digital program. Through a rapidly scaled social media strategy, I organically reached over 1 million people weekly and generated tens of thousands in grassroots fundraising. In addition to these responsibilities, I served as the logistical backbone of the campaign, coordinating logistics for over 100 events, including events with governors, members of Congress, and cabinet secretaries.",
    "link": "https://www.vanityfair.com/news/2022/06/democrats-midterms-house-michigan-districts-scholten-meijer?srsltid=AfmBOooi6_eeeo7sCC6_18of6nF6Zn3xuAW2tjtdvvn7wSxLcuuSMfhO",
    "link_text": "Read the Vanity Fair piece on the primary campaign here →"
  },
  {
    "dates": "January 2021 – August 2022",
    "role": "Research Assistant",
    "org": "Institute for Nonprofit News",
    "summary": "I worked on a small, international research team processing and analyzing quantitative data for the largest consortium of nonprofit news organizations in the world. I also worked with INN contractors on research into how stakeholders access news on digital and social platforms.",
    "link": "https://inn.org/research/inn-index/inn-index-2022/",
    "link_text": "See the 2022 INN Index report here →"
  }
]
